Raw-wrk-files/run-3/json/http-kit/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Mon Oct 21 12:12:35 PDT 2013

  System load:  0.01               Processes:           119
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer http-kit
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/http-kit/json
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/http-kit/json
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   273.40us  219.90us   8.27ms   97.98%
    Req/Sec     3.97k   549.05     5.55k    86.83%
  138144 requests in 5.00s, 22.13MB read
Requests/sec:  27628.70
Transfer/sec:      4.43MB

---------------------------------------------------------
 Running Warmup http-kit
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/http-kit/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/http-kit/json
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.12ms    2.29ms 622.37ms   96.55%
    Req/Sec    16.17k     3.05k   33.67k    71.03%
  1830567 requests in 15.00s, 293.29MB read
Requests/sec: 122039.08
Transfer/sec:     19.55MB

---------------------------------------------------------
 Concurrency: 8 for http-kit
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 8 -t 8 http://tfbapp:8080/http-kit/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/http-kit/json
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   260.41us  131.97us   9.28ms   99.56%
    Req/Sec     4.08k   265.47     5.00k    86.57%
  453037 requests in 15.00s, 72.58MB read
Requests/sec:  30202.44
Transfer/sec:      4.84MB

---------------------------------------------------------
 Concurrency: 16 for http-kit
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 16 -t 8 http://tfbapp:8080/http-kit/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/http-kit/json
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   255.87us  220.48us   9.29ms   99.48%
    Req/Sec     8.22k   722.58    10.11k    86.77%
  933794 requests in 15.00s, 149.61MB read
Requests/sec:  62253.00
Transfer/sec:      9.97MB

---------------------------------------------------------
 Concurrency: 32 for http-kit
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 32 -t 8 http://tfbapp:8080/http-kit/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/http-kit/json
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   353.30us  199.78us   8.03ms   84.61%
    Req/Sec    12.20k     2.22k   19.00k    67.78%
  1385729 requests in 15.00s, 222.02MB read
Requests/sec:  92383.73
Transfer/sec:     14.80MB

---------------------------------------------------------
 Concurrency: 64 for http-kit
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 64 -t 8 http://tfbapp:8080/http-kit/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/http-kit/json
  8 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   588.42us  333.31us   9.52ms   86.45%
    Req/Sec    14.71k     2.70k   22.78k    68.19%
  1672565 requests in 15.00s, 267.97MB read
Requests/sec: 111506.30
Transfer/sec:     17.87MB

---------------------------------------------------------
 Concurrency: 128 for http-kit
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 128 -t 8 http://tfbapp:8080/http-kit/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/http-kit/json
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  547.05us   9.53ms   80.07%
    Req/Sec    15.31k     2.60k   24.56k    69.07%
  1729905 requests in 15.00s, 277.16MB read
Requests/sec: 115329.15
Transfer/sec:     18.48MB

---------------------------------------------------------
 Concurrency: 256 for http-kit
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 256 -t 8 http://tfbapp:8080/http-kit/json
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/http-kit/json
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.32ms   13.78ms   1.46s    99.97%
    Req/Sec    15.97k     2.89k   33.56k    73.64%
  1799989 requests in 15.00s, 288.39MB read
Requests/sec: 119999.63
Transfer/sec:     19.23MB